Revit 2023 API
GroupTypeId.RailingSystemSegmentPatternRepeat Property
 "Pattern Repeat"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId RailingSystemSegmentPatternRepeat { get; }
Visual Basic
Public Shared ReadOnly Property RailingSystemSegmentPatternRepeat As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RailingSystemSegmentPatternRepeat {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace